#T20.29 В умовах задачі T20.28 визначити ймовірність розкладів при
#фіксованому роздаванні. Зафіксувати на першій руці карти так, щоб
#найкраща потенційно козирна масть складалась з 4 карт а також 2 карти,
#скинуті після взяття прикупу. Виконати фіксоване роздавання. Знайти
#ймовірності того, що на другій та третій руці інші 4 карти цієї масті роздано
#у співвідношенні 4:0, 1:3, 2:2, 3:1, 0:4.

#T20.28 В умовах попередньої задачі визначити ймовірність розкладів при грі
#у «мізер». Якщо один з гравців зобов’язується зіграти мізер, це означає
#зобов’язання за будь-яких умов не взяти жодної взятки. Для того, щоб
#гарантовано не взяти жодної взятки, за умови не власного першого ходу,
#треба у кожній наявній масті мати одну з таких комбінацій карт:
# комбінацію з однієї карти 7
# комбінацію з 2 карт 7, 8
# комбінацію з 2 карт 7, 9
# комбінацію з 3 карт: одну з комбінацій з 2 карт плюс 9 (для 7, 8) або 10
#або валет
# комбінацію з 4 карт: одну з комбінацій з 3 карт плюс 10 або валет
#(якщо 10 або валет немає у комбінації з 3 карт) або дама або король

# комбінацію з 5 або більше карт: одну з комбінацій з 4 карт плюс будь-
#які старші карти

#Знайти ймовірність наявності на будь-якій руці розкладу, що дозволяє за
#умови не власного першого ходу гарантовано не взяти жодної взятки:
#а) без урахування прикупу;
#б) з урахуванням прикупу.
#Розв’язати задачу методом Монте-Карло з використанням масивів numpy.
#Векторизувати програмний код, наскільки можливо.
